# PANDAS

In [3]:
import pandas as pd

In [4]:
print(pd.__version__)

2.2.3

In [5]:
lst=[1,2,3,4,5]
print(lst)

[1, 2, 3, 4, 5]

##  pd.Series

In [6]:
series=pd.Series(lst) # Series S caps  pd.Series
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
empty_series=pd.Series([])
print(empty_series)

Series([], dtype: object)

In [65]:
data=['c','d','e','f','g']
num=[12,13,14,15,16]
a=pd.Series(data,index=num)
print(a)

12    c
13    d
14    e
15    f
16    g
dtype: object

In [9]:
# add name 
data=['c','d','e','f','g']
num=[12,13,14,15,16]
b=pd.Series(data,index=num,name="alphabet")
print(b)

12    c
13    d
14    e
15    f
16    g
Name: alphabet, dtype: object

In [10]:
# scalar
scalar=pd.Series(0.10)
scalar

0    0.1
dtype: float64

In [11]:
scalar=pd.Series(0.5,index=[1,2,3])
scalar

1    0.5
2    0.5
3    0.5
dtype: float64

In [67]:
# create series using dictionary
value={'c':1,'d':2,'e':3,'h':6}
dict=pd.Series(value)
print(dict)

c    1
d    2
e    3
h    6
dtype: int64

In [68]:
dict[2]

C:\Users\HP\AppData\Local\Temp\ipykernel_17780\1163017172.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict[2]

np.int64(3)

In [15]:
dict[0:3] # extract the values

c    1
d    2
e    3
dtype: int64

In [16]:
max(dict)

6

In [69]:
# create series using list & dictionary
value={'c':[1,5],'d':[2,6,7],'e':[3,1,7],'h':[6,3,7]}
multidict = pd.Series(value)
print(multidict)

c       [1, 5]
d    [2, 6, 7]
e    [3, 1, 7]
h    [6, 3, 7]
dtype: object

# DataFrame 2d colln of data rows & column

In [23]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [24]:
data=[1,2,3,4,5]
df = pd.DataFrame(data) # method 1 
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [73]:
df= pd.DataFrame([5,2,6,4,7]) #method 2
df # assigns itself in rows

   0
0  5
1  2
2  6
3  4
4  7

In [50]:
# Manually creating DataFrame
# DataFrame using list
data=([1,2,3,4,5],[11,12,13,14,15],[16,17,18,19,20])
df=pd.DataFrame(data)
print(df)

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15
2  16  17  18  19  20

In [51]:
#DataFrame using dictionary
classes = {"name":["subi","rogu"],'a':[3,4],'b':[5,6],'g':[8,7]}
df = pd.DataFrame(classes)
print(df)

   name  a  b  g
0  subi  3  5  8
1  rogu  4  6  7

In [75]:
#DataFrame using dictionary
df = pd.DataFrame({"name":["subi","rogu"],'a':[3,4],'b':[5,6],'g':[8,7]})
df

   name  a  b  g
0  subi  3  5  8
1  rogu  4  6  7

In [52]:
#creating DataFrame using Series
data={"Rollno": pd.Series([1,2,3,4]),"Name":pd.Series(['subi','subu','sube','rogu']),"Mat":pd.Series([55,67,89,76]),'Art':pd.Series([65,35,77,94])}
df=pd.DataFrame(data)
print(df)

   Rollno  Name  Mat  Art
0       1  subi   55   65
1       2  subu   67   35
2       3  sube   89   77
3       4  rogu   76   94

In [54]:
# crating DataFrsme form .csv file Or excel file

In [ ]:
## read_csv(r"path     ")

In [66]:
df= pd.read_csv(r"D:\DATA MITES\Hospital ER.csv") # as init file will be in raw format , so (r) is used
df  # read_csv imports file as DataFrame to jup notebook

,date,patient_id,patient_gender,patient_age,patient_sat_score,patient_first_inital,patient_last_name,patient_race,patient_admin_flag,patient_waittime,department_referral
0,20-03-2020 08:47,145-39-5406,M,69,10.0,H,Glasspool,White,False,39,General Practice
1,15-06-2020 11:29,316-34-3057,M,4,NaN,X,Methuen,Native American/Alaska Native,True,27,General Practice
2,20-06-2020 09:13,897-46-3852,F,56,9.0,P,Schubuser,African American,True,55,General Practice
3,04-02-2020 22:34,358-31-9711,F,24,8.0,U,Titcombe,Native American/Alaska Native,True,31,General Practice
4,04-09-2020 17:48,289-26-0537,M,5,NaN,Y,Gionettitti,African American,False,10,Orthopedics
...,...,...,...,...,...,...,...,...,...,...,...
9211,25-10-2020 02:35,453-45-2632,M,60,NaN,A,Crich,African American,False,34,General Practice
9212,29-09-2019 15:50,136-93-5822,M,63,NaN,A,Gerbl,White,False,55,General Practice
9213,12-08-2020 14:46,822-41-7734,F,27,NaN,J,Dowall,Two or More Races,False,52,Orthopedics
9214,11-10-2019 16:46,260-14-4032,M,53,NaN,W,Rustan,White,True,51,General Practice
9215,01-06-2019 07:48,703-55-3364,M,30,NaN,H,Hickeringill,Pacific Islander,True,19,General Practice

In [64]:
type(df)

pandas.core.frame.DataFrame

## Functions of DataFrame

In [68]:
print(df.columns) # lists out the column names

Index(['date', 'patient_id', 'patient_gender', 'patient_age',
       'patient_sat_score', 'patient_first_inital', 'patient_last_name',
       'patient_race', 'patient_admin_flag', 'patient_waittime',
       'department_referral'],
      dtype='object')

In [83]:
print(df.shape) # returns rows,column

(9216, 11)

In [70]:
print(df.size) # returns tot no of cells

101376

In [84]:
df.head() # returns 1st 5 rows

,date,patient_id,patient_gender,patient_age,patient_sat_score,patient_first_inital,patient_last_name,patient_race,patient_admin_flag,patient_waittime,department_referral
0,20-03-2020 08:47,145-39-5406,M,69,10.0,H,Glasspool,White,False,39,General Practice
1,15-06-2020 11:29,316-34-3057,M,4,NaN,X,Methuen,Native American/Alaska Native,True,27,General Practice
2,20-06-2020 09:13,897-46-3852,F,56,9.0,P,Schubuser,African American,True,55,General Practice
3,04-02-2020 22:34,358-31-9711,F,24,8.0,U,Titcombe,Native American/Alaska Native,True,31,General Practice
4,04-09-2020 17:48,289-26-0537,M,5,NaN,Y,Gionettitti,African American,False,10,Orthopedics

In [74]:
df.head(3)

,date,patient_id,patient_gender,patient_age,patient_sat_score,patient_first_inital,patient_last_name,patient_race,patient_admin_flag,patient_waittime,department_referral
0,20-03-2020 08:47,145-39-5406,M,69,10.0,H,Glasspool,White,False,39,General Practice
1,15-06-2020 11:29,316-34-3057,M,4,NaN,X,Methuen,Native American/Alaska Native,True,27,General Practice
2,20-06-2020 09:13,897-46-3852,F,56,9.0,P,Schubuser,African American,True,55,General Practice

In [85]:
df.tail() # returns laat 5 rows

,date,patient_id,patient_gender,patient_age,patient_sat_score,patient_first_inital,patient_last_name,patient_race,patient_admin_flag,patient_waittime,department_referral
9211,25-10-2020 02:35,453-45-2632,M,60,NaN,A,Crich,African American,False,34,General Practice
9212,29-09-2019 15:50,136-93-5822,M,63,NaN,A,Gerbl,White,False,55,General Practice
9213,12-08-2020 14:46,822-41-7734,F,27,NaN,J,Dowall,Two or More Races,False,52,Orthopedics
9214,11-10-2019 16:46,260-14-4032,M,53,NaN,W,Rustan,White,True,51,General Practice
9215,01-06-2019 07:48,703-55-3364,M,30,NaN,H,Hickeringill,Pacific Islander,True,19,General Practice

In [82]:
df.tail(7)# returns last 7 rows

,date,patient_id,patient_gender,patient_age,patient_sat_score,patient_first_inital,patient_last_name,patient_race,patient_admin_flag,patient_waittime,department_referral
9209,13-06-2020 18:09,899-98-2466,M,65,NaN,V,Rodinger,African American,False,32,Neurology
9210,13-05-2019 15:26,581-09-2517,M,27,NaN,B,McCaughan,Asian,True,55,General Practice
9211,25-10-2020 02:35,453-45-2632,M,60,NaN,A,Crich,African American,False,34,General Practice
9212,29-09-2019 15:50,136-93-5822,M,63,NaN,A,Gerbl,White,False,55,General Practice
9213,12-08-2020 14:46,822-41-7734,F,27,NaN,J,Dowall,Two or More Races,False,52,Orthopedics
9214,11-10-2019 16:46,260-14-4032,M,53,NaN,W,Rustan,White,True,51,General Practice
9215,01-06-2019 07:48,703-55-3364,M,30,NaN,H,Hickeringill,Pacific Islander,True,19,General Practice

In [81]:
df.describe() # describes numeric opern

       patient_age  patient_sat_score  patient_waittime
count  9216.000000        2517.000000       9216.000000
mean     39.855143           4.992054         35.259874
std      22.755125           3.138043         14.735323
min       1.000000           0.000000         10.000000
25%      20.000000           2.000000         23.000000
50%      39.000000           5.000000         35.000000
75%      60.000000           8.000000         48.000000
max      79.000000          10.000000         60.000000

In [87]:
print(df.info()) # counts datatype,nonnull,nullvalues
# print removed also fn runs

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9216 entries, 0 to 9215
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   date                  9216 non-null   object
 1   patient_id            9216 non-null   object
 2   patient_gender        9216 non-null   object
 3   patient_age           9216 non-null   int64
 4   patient_sat_score     2517 non-null   float64
 5   patient_first_inital  9216 non-null   object
 6   patient_last_name     9216 non-null   object
 7   patient_race          9216 non-null   object
 8   patient_admin_flag    9216 non-null   bool
 9   patient_waittime      9216 non-null   int64
 10  department_referral   9216 non-null   object
dtypes: bool(1), float64(1), int64(2), object(7)
memory usage: 729.1+ KB
None

### practice pd.read_csv

In [88]:
# new dataset for practice
df2 = pd.read_csv(r"C:\Users\HP\Downloads\Day 59 Salary_Data.csv")

In [89]:
df2.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [90]:
df2.shape

(30, 2)

In [92]:
df2.size

60

In [93]:
df2.tail(4)

    YearsExperience    Salary
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [95]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [96]:
df2.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

## handling nulll values

In [2]:
import pandas as pd

In [40]:
df3=pd.read_csv(r"C:\Users\HP\Downloads\sample_data.csv")

In [5]:
df3.head()

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie   NaN      Chicago
3    David  40.0          NaN
4      Eva  22.0      Houston

In [10]:
df3.isnull()

     Name    Age   City
0   False  False  False
1   False  False  False
2   False   True  False
3   False  False   True
4   False  False  False
5   False   True  False
6   False  False   True
7   False  False  False
8   False   True  False
9   False  False  False
10  False  False  False
11  False  False   True
12  False  False  False
13  False   True  False
14  False  False  False
15  False  False  False
16  False   True   True
17  False  False  False
18  False  False  False
19  False   True   True

In [12]:
df3.isnull().sum()

Name    0
Age     6
City    5
dtype: int64

In [13]:
df3.isnull().sum().sum()

np.int64(11)

In [16]:
df3.shape

(20, 3)

In [17]:
df4=df3.dropna()

In [19]:
df4.shape # prev 20 now 11, 9 null value rows are removed

(11, 3)

In [20]:
df4

      Name   Age          City
0    Alice  25.0      New York
1      Bob  30.0   Los Angeles
4      Eva  22.0       Houston
7   Hannah  31.0     San Diego
9     Jack  28.0      San Jose
10   Karen  33.0        Austin
12    Mona  26.0  Jacksonville
14   Oscar  35.0      Columbus
15    Paul  38.0     Charlotte
17  Rachel  24.0  Indianapolis
18   Steve  32.0       Seattle

In [26]:
df5=df3.dropna(axis=1) # removes 1 column  specifically as other contains null value
df5

       Name
0     Alice
1       Bob
2   Charlie
3     David
4       Eva
5     Frank
6     Grace
7    Hannah
8       Ian
9      Jack
10    Karen
11      Leo
12     Mona
13     Nina
14    Oscar
15     Paul
16    Quinn
17   Rachel
18    Steve
19     Tina

In [24]:
df5.shape

(20, 1)

In [27]:
df3.dropna(how ="any") # row deleted even if any 1 cell is null

      Name   Age          City
0    Alice  25.0      New York
1      Bob  30.0   Los Angeles
4      Eva  22.0       Houston
7   Hannah  31.0     San Diego
9     Jack  28.0      San Jose
10   Karen  33.0        Austin
12    Mona  26.0  Jacksonville
14   Oscar  35.0      Columbus
15    Paul  38.0     Charlotte
17  Rachel  24.0  Indianapolis
18   Steve  32.0       Seattle

In [28]:
df3.dropna(how="all")

       Name   Age          City
0     Alice  25.0      New York
1       Bob  30.0   Los Angeles
2   Charlie   NaN       Chicago
3     David  40.0           NaN
4       Eva  22.0       Houston
5     Frank   NaN       Phoenix
6     Grace  29.0           NaN
7    Hannah  31.0     San Diego
8       Ian   NaN        Dallas
9      Jack  28.0      San Jose
10    Karen  33.0        Austin
11      Leo  27.0           NaN
12     Mona  26.0  Jacksonville
13     Nina   NaN    Fort Worth
14    Oscar  35.0      Columbus
15     Paul  38.0     Charlotte
16    Quinn   NaN           NaN
17   Rachel  24.0  Indianapolis
18    Steve  32.0       Seattle
19     Tina   NaN           NaN

In [37]:
df3.dropna(inplace=True) # removes the null value rows automatucally

In [38]:
df3

      Name   Age          City
0    Alice  25.0      New York
1      Bob  30.0   Los Angeles
4      Eva  22.0       Houston
7   Hannah  31.0     San Diego
9     Jack  28.0      San Jose
10   Karen  33.0        Austin
12    Mona  26.0  Jacksonville
14   Oscar  35.0      Columbus
15    Paul  38.0     Charlotte
17  Rachel  24.0  Indianapolis
18   Steve  32.0       Seattle

In [36]:
df3.shape

(11, 3)

In [44]:
df3.fillna(0) # replace null with 0

       Name   Age          City
0     Alice  25.0      New York
1       Bob  30.0   Los Angeles
2   Charlie   0.0       Chicago
3     David  40.0             0
4       Eva  22.0       Houston
5     Frank   0.0       Phoenix
6     Grace  29.0             0
7    Hannah  31.0     San Diego
8       Ian   0.0        Dallas
9      Jack  28.0      San Jose
10    Karen  33.0        Austin
11      Leo  27.0             0
12     Mona  26.0  Jacksonville
13     Nina   0.0    Fort Worth
14    Oscar  35.0      Columbus
15     Paul  38.0     Charlotte
16    Quinn   0.0             0
17   Rachel  24.0  Indianapolis
18    Steve  32.0       Seattle
19     Tina   0.0             0

In [48]:
df3.fillna({'Age':21,'City':'Gobi'}) # fill partivular value for entire null colum

       Name   Age          City
0     Alice  25.0      New York
1       Bob  30.0   Los Angeles
2   Charlie  21.0       Chicago
3     David  40.0          Gobi
4       Eva  22.0       Houston
5     Frank  21.0       Phoenix
6     Grace  29.0          Gobi
7    Hannah  31.0     San Diego
8       Ian  21.0        Dallas
9      Jack  28.0      San Jose
10    Karen  33.0        Austin
11      Leo  27.0          Gobi
12     Mona  26.0  Jacksonville
13     Nina  21.0    Fort Worth
14    Oscar  35.0      Columbus
15     Paul  38.0     Charlotte
16    Quinn  21.0          Gobi
17   Rachel  24.0  Indianapolis
18    Steve  32.0       Seattle
19     Tina  21.0          Gobi

In [52]:
df3.fillna(method="ffill") # fills prev row value in null places

C:\Users\HP\AppData\Local\Temp\ipykernel_17780\1209724018.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df3.fillna(method="ffill") # fills prev value in null places

       Name   Age          City
0     Alice  25.0      New York
1       Bob  30.0   Los Angeles
2   Charlie  30.0       Chicago
3     David  40.0       Chicago
4       Eva  22.0       Houston
5     Frank  22.0       Phoenix
6     Grace  29.0       Phoenix
7    Hannah  31.0     San Diego
8       Ian  31.0        Dallas
9      Jack  28.0      San Jose
10    Karen  33.0        Austin
11      Leo  27.0        Austin
12     Mona  26.0  Jacksonville
13     Nina  26.0    Fort Worth
14    Oscar  35.0      Columbus
15     Paul  38.0     Charlotte
16    Quinn  38.0     Charlotte
17   Rachel  24.0  Indianapolis
18    Steve  32.0       Seattle
19     Tina  32.0       Seattle

In [54]:
df3.fillna(method="ffill",axis=1) # fills column value of adj row

C:\Users\HP\AppData\Local\Temp\ipykernel_17780\151892834.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df3.fillna(method="ffill",axis=1) # fills value of adj row

       Name      Age          City
0     Alice     25.0      New York
1       Bob     30.0   Los Angeles
2   Charlie  Charlie       Chicago
3     David     40.0          40.0
4       Eva     22.0       Houston
5     Frank    Frank       Phoenix
6     Grace     29.0          29.0
7    Hannah     31.0     San Diego
8       Ian      Ian        Dallas
9      Jack     28.0      San Jose
10    Karen     33.0        Austin
11      Leo     27.0          27.0
12     Mona     26.0  Jacksonville
13     Nina     Nina    Fort Worth
14    Oscar     35.0      Columbus
15     Paul     38.0     Charlotte
16    Quinn    Quinn         Quinn
17   Rachel     24.0  Indianapolis
18    Steve     32.0       Seattle
19     Tina     Tina          Tina

In [58]:
df3["Age"].fillna(df3["Age"].mean()) # fills with avg

0     25.0
1     30.0
2     30.0
3     40.0
4     22.0
5     30.0
6     29.0
7     31.0
8     30.0
9     28.0
10    33.0
11    27.0
12    26.0
13    30.0
14    35.0
15    38.0
16    30.0
17    24.0
18    32.0
19    30.0
Name: Age, dtype: float64

In [59]:
df3.fillna(method="bfill",inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_17780\3336091803.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df3.fillna(method="bfill",inplace=True)

In [60]:
df3

       Name   Age          City
0     Alice  25.0      New York
1       Bob  30.0   Los Angeles
2   Charlie  40.0       Chicago
3     David  40.0       Houston
4       Eva  22.0       Houston
5     Frank  29.0       Phoenix
6     Grace  29.0     San Diego
7    Hannah  31.0     San Diego
8       Ian  28.0        Dallas
9      Jack  28.0      San Jose
10    Karen  33.0        Austin
11      Leo  27.0  Jacksonville
12     Mona  26.0  Jacksonville
13     Nina  35.0    Fort Worth
14    Oscar  35.0      Columbus
15     Paul  38.0     Charlotte
16    Quinn  24.0  Indianapolis
17   Rachel  24.0  Indianapolis
18    Steve  32.0       Seattle
19     Tina   NaN           NaN

# replace

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\HP\Downloads\Day 60-sample.csv")

In [3]:
df.head()

   Roll No.  Physics  Chemistry  Maths  Computer
0         1     56.0       57.0   58.0      59.0
1         2     23.0       24.0   25.0      26.0
2         3     89.0       25.0   26.0      27.0
3         4     45.0       26.0   27.0      28.0
4         5     23.0       27.0   28.0      29.0

In [7]:
df.replace(26,30) # it replaces 26 and shows value 30
# (or)df.replace(to_replace=26,value=30)

    Roll No.  Physics  Chemistry  Maths  Computer
0          1     56.0       57.0   58.0      59.0
1          2     23.0       24.0   25.0      30.0
2          3     89.0       25.0   30.0      27.0
3          4     45.0       30.0   27.0      28.0
4          5     23.0       27.0   28.0      29.0
5          6     90.0        NaN   29.0      30.0
6          7     12.0       13.0   14.0      15.0
7          8     78.0       14.0   15.0      16.0
8          9      NaN       15.0   16.0      17.0
9         10     45.0       16.0   17.0      18.0
10        11      NaN       17.0   18.0      19.0
11        12     88.0        NaN   19.0      20.0
12        13     22.0       23.0   24.0      25.0
13        14     90.0        NaN    NaN      42.0
14        15      NaN       43.0   43.0      43.0
15        16     44.0       44.0   44.0      44.0
16        17     45.0       45.0   45.0      45.0
17        18     46.0       46.0   46.0      46.0
18        19     47.0       47.0   47.0      47.0
19        20     48.0       48.0   48.0      48.0
20        21     49.0       49.0   49.0      49.0
21        22     50.0       50.0   50.0      50.0
22        23     51.0       51.0   51.0      51.0
23        24     52.0       52.0   52.0      52.0
24        25     53.0        NaN    NaN      53.0
25        30     54.0       33.0   33.0      54.0
26        27     55.0       34.0   34.0      55.0
27        28     56.0       35.0   35.0       NaN
28        29     57.0       36.0   36.0      66.0
29        30     58.0       37.0   37.0      43.0

In [9]:
df.replace([51,52,53],"A") # multiple value replace

    Roll No. Physics Chemistry Maths Computer
0          1    56.0      57.0  58.0     59.0
1          2    23.0      24.0  25.0     26.0
2          3    89.0      25.0  26.0     27.0
3          4    45.0      26.0  27.0     28.0
4          5    23.0      27.0  28.0     29.0
5          6    90.0       NaN  29.0     30.0
6          7    12.0      13.0  14.0     15.0
7          8    78.0      14.0  15.0     16.0
8          9     NaN      15.0  16.0     17.0
9         10    45.0      16.0  17.0     18.0
10        11     NaN      17.0  18.0     19.0
11        12    88.0       NaN  19.0     20.0
12        13    22.0      23.0  24.0     25.0
13        14    90.0       NaN   NaN     42.0
14        15     NaN      43.0  43.0     43.0
15        16    44.0      44.0  44.0     44.0
16        17    45.0      45.0  45.0     45.0
17        18    46.0      46.0  46.0     46.0
18        19    47.0      47.0  47.0     47.0
19        20    48.0      48.0  48.0     48.0
20        21    49.0      49.0  49.0     49.0
21        22    50.0      50.0  50.0     50.0
22        23       A         A     A        A
23        24       A         A     A        A
24        25       A       NaN   NaN        A
25        26    54.0      33.0  33.0     54.0
26        27    55.0      34.0  34.0     55.0
27        28    56.0      35.0  35.0      NaN
28        29    57.0      36.0  36.0     66.0
29        30    58.0      37.0  37.0     43.0

In [11]:
# replace muli value whit multi value
df.replace([51,52,53],['A','B','C'])

    Roll No. Physics Chemistry Maths Computer
0          1    56.0      57.0  58.0     59.0
1          2    23.0      24.0  25.0     26.0
2          3    89.0      25.0  26.0     27.0
3          4    45.0      26.0  27.0     28.0
4          5    23.0      27.0  28.0     29.0
5          6    90.0       NaN  29.0     30.0
6          7    12.0      13.0  14.0     15.0
7          8    78.0      14.0  15.0     16.0
8          9     NaN      15.0  16.0     17.0
9         10    45.0      16.0  17.0     18.0
10        11     NaN      17.0  18.0     19.0
11        12    88.0       NaN  19.0     20.0
12        13    22.0      23.0  24.0     25.0
13        14    90.0       NaN   NaN     42.0
14        15     NaN      43.0  43.0     43.0
15        16    44.0      44.0  44.0     44.0
16        17    45.0      45.0  45.0     45.0
17        18    46.0      46.0  46.0     46.0
18        19    47.0      47.0  47.0     47.0
19        20    48.0      48.0  48.0     48.0
20        21    49.0      49.0  49.0     49.0
21        22    50.0      50.0  50.0     50.0
22        23       A         A     A        A
23        24       B         B     B        B
24        25       C       NaN   NaN        C
25        26    54.0      33.0  33.0     54.0
26        27    55.0      34.0  34.0     55.0
27        28    56.0      35.0  35.0      NaN
28        29    57.0      36.0  36.0     66.0
29        30    58.0      37.0  37.0     43.0

In [12]:
# replace in specific column
df['Maths'].replace([50,51,45],['x','y','z'])

0     58.0
1     25.0
2     26.0
3     27.0
4     28.0
5     29.0
6     14.0
7     15.0
8     16.0
9     17.0
10    18.0
11    19.0
12    24.0
13     NaN
14    43.0
15    44.0
16       z
17    46.0
18    47.0
19    48.0
20    49.0
21       x
22       y
23    52.0
24     NaN
25    33.0
26    34.0
27    35.0
28    36.0
29    37.0
Name: Maths, dtype: object

In [13]:
# replace a regular expression alphabetical characters
df=pd.read_csv(r"C:\Users\HP\Downloads\Day 60-sample.csv")

### regex=True

In [15]:
df.replace('[A-Za-z]',0,regex=True) # to replace alphabet ch

    Roll No.  Physics Chemistry Maths Computer
0          1     56.0        57    58       59
1          2     23.0        24    25       26
2          3     89.0        25    26       27
3          4     45.0        26    27       28
4          5     23.0        27    28       29
5          6     90.0       NaN    29       30
6          7     12.0        13    14       15
7          8     78.0        14    15       16
8          9      NaN        15    16       17
9         10     45.0        16    17       18
10        11      NaN        17    18       19
11        12     88.0       NaN    19       20
12        13     22.0        23    24       25
13        14     90.0       NaN   NaN       42
14        15      NaN        43    43       43
15        16     44.0        44     0       44
16        17     45.0        45    45       45
17        18     46.0        46    46       46
18        19     47.0        47    47       47
19        20     48.0        48    48       48
20        21     49.0         0    49       49
21        22     50.0         0    50       50
22        23     51.0         0    51       51
23        24     52.0         0    52       52
24        25     53.0       NaN   NaN       53
25        26     54.0         0    33       54
26        27     55.0         0    34       55
27        28     56.0        35    35        0
28        29     57.0        36    36       66
29        30     58.0        37    37       43

# loc - location , iloc-index location

In [16]:
import pandas as pd

In [17]:
df=pd.read_csv(r"C:\Users\HP\Downloads\sample2.csv",
               index_col =['Roll No.'])
df.head()

         Section Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
1              A     CS     56.0       57.0   58.0        59  01-01-2001
2              A    ECE     24.0       25.0   26.0        26  02-01-2001
3              B   MECH     89.0       25.0   26.0        27  03-01-2001
4              C   MECH     45.0       26.0   27.0        28  04-01-2001
5              C     CS     23.0       27.0   28.0        29  05-01-2001

In [21]:
df.loc[1]

Section               A
Branch               CS
Physics            56.0
Chemistry          57.0
Maths              58.0
Computer             59
DOB          01-01-2001
Name: 1, dtype: object

In [22]:
df.loc[5]

Section               C
Branch               CS
Physics            23.0
Chemistry          27.0
Maths              28.0
Computer             29
DOB          05-01-2001
Name: 5, dtype: object

In [23]:
# location of array(list inside a list) of numbers
df.loc[[5,6,7,8]] # o/p like in table data format

         Section Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
5              C     CS     23.0       27.0   28.0        29  05-01-2001
6              A    ECE     90.0        NaN   30.0        30  06-01-2001
7              B     CS     12.0       13.0   14.0        15  07-01-2001
8              C    NaN     78.0       14.0   15.0        16  08-01-2001

In [25]:
df.loc[5,'Maths'] # assess specic locn

np.float64(28.0)

In [27]:
df.loc[5:10,'Computer']

Roll No.
5     29
6     30
7     15
8     16
9     17
10    18
Name: Computer, dtype: int64

In [32]:
# filter data by using loc function
df.loc[df['Physics']<50] # filters stu belo 50 marks in mat

         Section Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
2              A    ECE     24.0       25.0   26.0        26  02-01-2001
4              C   MECH     45.0       26.0   27.0        28  04-01-2001
5              C     CS     23.0       27.0   28.0        29  05-01-2001
7              B     CS     12.0       13.0   14.0        15  07-01-2001
10             A     CS     45.0       16.0   17.0        18  10-01-2001
13             A     CS     22.0       23.0   24.0        25  13-01-2001
16             C    NaN     44.0       44.0   44.0        44  16-01-2001
17             A   MECH     45.0       45.0   45.0        45  17-01-2001
18             A   MECH     46.0       46.0   46.0        46  18-01-2001
19             B    ECE     47.0       47.0   47.0        47  19-01-2001
20             C   MECH     48.0       48.0   48.0        48  20-01-2001
21             A   MECH     49.0       49.0   49.0        49  21-01-2001

In [33]:
df.loc[df['Physics']>80]

         Section Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
3              B   MECH     89.0       25.0   26.0        27  03-01-2001
6              A    ECE     90.0        NaN   30.0        30  06-01-2001
12             C     CS     88.0        NaN   20.0        20  12-01-2001
14             A     CS     90.0        NaN    NaN        42  14-01-2001

In [34]:
# filtering stu got >80 in phy and their mat mark shold be displayed
df.loc[df['Physics']>80,"Maths"]

Roll No.
3     26.0
6     30.0
12    20.0
14     NaN
Name: Maths, dtype: float64

# ilocation index location - takes default index value

In [35]:
df.iloc[0] # as it takes default index; it prints 1st row values

Section               A
Branch               CS
Physics            56.0
Chemistry          57.0
Maths              58.0
Computer             59
DOB          01-01-2001
Name: 1, dtype: object

In [36]:
df.iloc[0:5] # or df.iloc[[0,1,2,3,4]]

         Section Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
1              A     CS     56.0       57.0   58.0        59  01-01-2001
2              A    ECE     24.0       25.0   26.0        26  02-01-2001
3              B   MECH     89.0       25.0   26.0        27  03-01-2001
4              C   MECH     45.0       26.0   27.0        28  04-01-2001
5              C     CS     23.0       27.0   28.0        29  05-01-2001

In [37]:
df.iloc[[0,1,2]]

         Section Branch  Physics  Chemistry  Maths  Computer         DOB
Roll No.
1              A     CS     56.0       57.0   58.0        59  01-01-2001
2              A    ECE     24.0       25.0   26.0        26  02-01-2001
3              B   MECH     89.0       25.0   26.0        27  03-01-2001

In [40]:
#all rows from 1st column
df.iloc[:0]

Empty DataFrame
Columns: [Section, Branch, Physics, Chemistry, Maths, Computer, DOB]
Index: []

In [41]:
#all rows from 1st column
df.iloc[:,0] # ,0 see the differences

Roll No.
1     A
2     A
3     B
4     C
5     C
6     A
7     B
8     C
9     A
10    A
11    B
12    C
13    A
14    A
15    B
16    C
17    A
18    A
19    B
20    C
21    A
22    A
Name: Section, dtype: object

In [45]:
df.iloc[:,1]

Roll No.
1       CS
2      ECE
3     MECH
4     MECH
5       CS
6      ECE
7       CS
8      NaN
9      ECE
10      CS
11     ECE
12      CS
13      CS
14      CS
15     ECE
16     NaN
17    MECH
18    MECH
19     ECE
20    MECH
21    MECH
22    MECH
Name: Branch, dtype: object

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\HP\Downloads\sample2.csv")

In [3]:
df.head()

   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
0         1       A     CS     56.0       57.0   58.0        59  01-01-2001
1         2       A    ECE     24.0       25.0   26.0        26  02-01-2001
2         3       B   MECH     89.0       25.0   26.0        27  03-01-2001
3         4       C   MECH     45.0       26.0   27.0        28  04-01-2001
4         5       C     CS     23.0       27.0   28.0        29  05-01-2001

# groupby

In [5]:
branch_group= df.groupby(by="Branch")
print(branch_group.groups) #.gruops

{'CS': [0, 4, 6, 9, 11, 12, 13], 'ECE': [1, 5, 8, 10, 14, 18], 'MECH': [2, 3, 16, 17, 19, 20, 21]}

In [6]:
branch_section_group=df.groupby(by=["Branch","Section"])
print(branch_section_group.groups)

{('CS', 'A'): [0, 9, 12, 13], ('CS', 'B'): [6], ('CS', 'C'): [4, 11], ('ECE', 'A'): [1, 5, 8], ('ECE', 'B'): [10, 14, 18], ('MECH', 'A'): [16, 17, 20, 21], ('MECH', 'B'): [2], ('MECH', 'C'): [3, 19], (nan, 'C'): [7, 15]}

## for loop in groupby to print individually

In [7]:
for group , dataframe in branch_section_group: # groups,dataframe are any new var
    print(group)
    print(dataframe)

('CS', 'A')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
0          1       A     CS     56.0       57.0   58.0        59  01-01-2001
9         10       A     CS     45.0       16.0   17.0        18  10-01-2001
12        13       A     CS     22.0       23.0   24.0        25  13-01-2001
13        14       A     CS     90.0        NaN    NaN        42  14-01-2001
('CS', 'B')
   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
6         7       B     CS     12.0       13.0   14.0        15  07-01-2001
('CS', 'C')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
4          5       C     CS     23.0       27.0   28.0        29  05-01-2001
11        12       C     CS     88.0        NaN   20.0        20  12-01-2001
('ECE', 'A')
   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
1         2       A    ECE     24.0       25.0   26.0        26  02-01-2001
5         6       A    ECE     90.0        NaN   30.0        30  06-01-2001
8         9       A    ECE      NaN       15.0   16.0        17  09-01-2001
('ECE', 'B')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
10        11       B    ECE      NaN       17.0   19.0        19  11-01-2001
14        15       B    ECE      NaN       43.0   43.0        43  15-01-2001
18        19       B    ECE     47.0       47.0   47.0        47  19-01-2001
('MECH', 'A')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
16        17       A   MECH     45.0       45.0   45.0        45  17-01-2001
17        18       A   MECH     46.0       46.0   46.0        46  18-01-2001
20        21       A   MECH     49.0       49.0   49.0        49  21-01-2001
21        22       A   MECH     50.0       50.0   50.0        50  22-01-2001
('MECH', 'B')
   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
2         3       B   MECH     89.0       25.0   26.0        27  03-01-2001
('MECH', 'C')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
3          4       C   MECH     45.0       26.0   27.0        28  04-01-2001
19        20       C   MECH     48.0       48.0   48.0        48  20-01-2001

# merge

In [8]:
df1=pd.DataFrame({
    'roll_no':[1,2,3,4,5],'arts':[70,80,76,53,73]
 })

df2=pd.DataFrame({
    'roll_no':[1,2,3,4,5],'science':[45,32,65,32,21]
})
# to show it is in this order

In [12]:
merged_df=pd.merge(df1,df2, on='roll_no') # if not mentioned from on it automatically checks common values and assigns
print(merged_df)

   roll_no  arts  science
0        1    70       45
1        2    80       32
2        3    76       65
3        4    53       32
4        5    73       21

In [15]:
merged_df=pd.merge(df1,df2)
print(merged_df)

   roll_no  arts  science
0        1    70       45
1        2    80       32
2        3    76       65
3        4    53       32
4        5    73       21

In [16]:
merged_df=pd.merge(df2,df1) # swaps
print(merged_df)

   roll_no  science  arts
0        1       45    70
1        2       32    80
2        3       65    76
3        4       32    53
4        5       21    73

In [19]:
df3=pd.DataFrame({
    'row_no':[1,2,3,6,7],'arts_stu':[70,80,76,53,73]
 })

df4=pd.DataFrame({
    'row_no':[1,2,3,8,5],'science_stu':[45,32,65,32,21]
})

In [20]:
merged_df=pd.merge(df3,df4,on='row_no') # only merges common 
print(merged_df)

   row_no  arts_stu  science_stu
0       1        70           45
1       2        80           32
2       3        76           65

### left, right,outer merge parameter how

In [22]:
left_merged=pd.merge(df3,df4,on='row_no',how='left') # left from row no df3 only prints
print(left_merged)

   row_no  arts_stu  science_stu
0       1        70         45.0
1       2        80         32.0
2       3        76         65.0
3       6        53          NaN
4       7        73          NaN

In [24]:
right_merged=pd.merge(df3,df4,on='row_no',how='right') # right from row no df4 only prints
print(right_merged)

   row_no  arts_stu  science_stu
0       1      70.0           45
1       2      80.0           32
2       3      76.0           65
3       8       NaN           32
4       5       NaN           21

In [25]:
outer_merged=pd.merge(df3,df4,on='row_no',how='outer') 
print(outer_merged)

   row_no  arts_stu  science_stu
0       1      70.0         45.0
1       2      80.0         32.0
2       3      76.0         65.0
3       5       NaN         21.0
4       6      53.0          NaN
5       7      73.0          NaN
6       8       NaN         32.0

# append -  concat

In [14]:
import pandas as pd

In [15]:
df1=pd.DataFrame({
    'roll_no':[1,2,3,4,5],
    'maths':[98,29,76,54,65],
    'physics':[65,84,94,23,62]
})
df2=pd.DataFrame({
    'roll_no':[6,7,8,9,10],
    'maths':[48,99,56,64,85],
    'physics':[68,82,76,89,79]
})

In [16]:
df3=pd.append([df1,df2]) #append is updated as concat
print(df3)

AttributeError: module 'pandas' has no attribute 'append'

In [17]:
df3=pd.concat([df1,df2])
print(df3)

   roll_no  maths  physics
0        1     98       65
1        2     29       84
2        3     76       94
3        4     54       23
4        5     65       62
0        6     48       68
1        7     99       82
2        8     56       76
3        9     64       89
4       10     85       79

In [19]:
df4=pd.concat([df2,df1]) # 1st mentioned dataframe comes first
print(df4)

   roll_no  maths  physics
0        6     48       68
1        7     99       82
2        8     56       76
3        9     64       89
4       10     85       79
0        1     98       65
1        2     29       84
2        3     76       94
3        4     54       23
4        5     65       62

## ignore index

In [23]:
df4=pd.concat([df2,df1],ignore_index=True) 
print(df4) # shows continuous index

   roll_no  maths  physics
0        6     48       68
1        7     99       82
2        8     56       76
3        9     64       89
4       10     85       79
5        1     98       65
6        2     29       84
7        3     76       94
8        4     54       23
9        5     65       62

In [25]:
df4=pd.concat([df2,df1],ignore_index=True,sort=True) 
print(df4) # sorts based on alphabet from atoz in column name

   maths  physics  roll_no
0     48       68        6
1     99       82        7
2     56       76        8
3     64       89        9
4     85       79       10
5     98       65        1
6     29       84        2
7     76       94        3
8     54       23        4
9     65       62        5

In [26]:
df1=pd.DataFrame({'roll_no':[1,2,3,4,5],'chemistry':[98,29,76,54,65],'physics':[65,84,94,23,62]})
df2=pd.DataFrame({'roll_no':[6,7,8,9,10],'maths':[48,99,56,64,85],'physics':[68,82,76,89,79]})
print(df1)
print(df2)

   roll_no  chemistry  physics
0        1         98       65
1        2         29       84
2        3         76       94
3        4         54       23
4        5         65       62
   roll_no  maths  physics
0        6     48       68
1        7     99       82
2        8     56       76
3        9     64       89
4       10     85       79

In [28]:
df_combined=pd.concat([df1,df2],ignore_index=True)
print(df_combined)

   roll_no  chemistry  physics  maths
0        1       98.0       65    NaN
1        2       29.0       84    NaN
2        3       76.0       94    NaN
3        4       54.0       23    NaN
4        5       65.0       62    NaN
5        6        NaN       68   48.0
6        7        NaN       82   99.0
7        8        NaN       76   56.0
8        9        NaN       89   64.0
9       10        NaN       79   85.0

# PIVOT TABLE PANDAS ### aggregate function

In [29]:
import pandas as pd

In [30]:
df=pd.read_csv(r"C:\Users\HP\Downloads\sample2.csv")
df.head()

   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
0         1       A     CS     56.0       57.0   58.0        59  01-01-2001
1         2       A    ECE     24.0       25.0   26.0        26  02-01-2001
2         3       B   MECH     89.0       25.0   26.0        27  03-01-2001
3         4       C   MECH     45.0       26.0   27.0        28  04-01-2001
4         5       C     CS     23.0       27.0   28.0        29  05-01-2001

In [33]:
# Creating Pivot Table to analyze average scores by Branch

pivot_branch = df.pivot_table(index='Branch',values=['Physics','Chemistry','Maths','Computer'],aggfunc='mean')
print('Average Scores by Branch:')
print(pivot_branch)

Average Scores by Branch:
        Chemistry   Computer      Maths    Physics
Branch
CS      27.200000  29.714286  26.833333  48.000000
ECE     29.400000  30.333333  30.166667  53.666667
MECH    41.285714  41.857143  41.571429  53.142857

In [36]:
# Creating Pivot Table to analyze average scores by Section

pivot_section = df.pivot_table(index='Section',values=['Physics','Chemistry','Maths','Computer'],aggfunc='mean')
print('Average Scores by Section:')
print(pivot_section)

Average Scores by Section:
         Chemistry   Computer      Maths    Physics
Section
A        36.222222  37.000000  36.100000  51.700000
B        29.000000  30.200000  29.800000  49.333333
C        31.800000  30.833333  30.333333  54.333333

In [39]:
# creating Pivot Table to count the no of students per batch
pivot_count = df.pivot_table(index='Branch',values='Roll No.',aggfunc='count')
print('No of stu per Branch:')
print(pivot_count)

No of stu per Branch:
        Roll No.
Branch
CS             7
ECE            6
MECH           7

In [40]:
# aggregate fn sum
pivot_section = df.pivot_table(index='Section',values=['Physics','Chemistry','Maths','Computer'],aggfunc='sum')
print('Average Scores by Section:')
print(pivot_section)

Average Scores by Section:
         Chemistry  Computer  Maths  Physics
Section
A            326.0       407  361.0    517.0
B            145.0       151  149.0    148.0
C            159.0       185  182.0    326.0

In [41]:
# aggregate fn max
pivot_section = df.pivot_table(index='Section',values=['Physics','Chemistry','Maths','Computer'],aggfunc='max')
print('Average Scores by Section:')
print(pivot_section)

Average Scores by Section:
         Chemistry  Computer  Maths  Physics
Section
A             57.0        59   58.0     90.0
B             47.0        47   47.0     89.0
C             48.0        48   48.0     88.0